{
  "@type": "Schema",
  "@context": "https://rocketschema.org/context",
  "name": "PasswordHistory",
  "description": "Maintains a chronological record of credential changes for security principals, enabling enforcement of non-reuse policies and supporting security audit requirements. This entity captures the lifecycle of authentication credentials across any domain requiring identity verification - from corporate systems and financial services to healthcare portals and educational platforms. When a principal updates their credential, the previous credential is archived in this history, allowing systems to prevent cycling through previously compromised or weak credentials. Organizations typically configure retention policies specifying how many historical credentials to maintain (commonly 5-24 entries) and for how long (often 90-365 days). The entity stores only cryptographically hashed representations of credentials, never plaintext values, ensuring that even historical records maintain security standards. Beyond password reuse prevention, this history enables critical security analytics: identifying principals who change credentials frequently (potentially indicating account sharing or credential compromise), detecting mass credential changes that might signal security incidents, supporting compliance audits for industries with regulatory requirements around credential management, and providing forensic evidence during security investigations. The change reason tracking distinguishes between routine expirations, user-initiated updates, administrative interventions, and security-driven resets.",
  "properties": [
    {
      "name": "principal",
      "type": "SecurityPrincipal",
      "mode": "stored",
      "description": "The security principal (user, service account, system) whose credential history this represents, establishing the ownership relationship for the historical credential record",
      "required": true
    },
    {
      "name": "credentialHash",
      "type": "string",
      "mode": "stored",
      "description": "The cryptographically hashed representation of the historical credential, stored to enable comparison with new credentials without exposing the original value, following security best practices for credential storage",
      "required": true,
      "private": true
    },
    {
      "name": "hashingAlgorithm",
      "type": "string",
      "mode": "stored",
      "description": "The cryptographic hashing algorithm used to generate the credential hash, such as argon2id, bcrypt, scrypt, or PBKDF2, necessary for verifying credentials against this historical entry",
      "required": true,
      "example": "argon2id"
    },
    {
      "name": "effectiveFrom",
      "type": "DateTime",
      "mode": "stored",
      "description": "The timestamp when this credential became active and was first valid for authentication, marking the beginning of this credential's lifecycle",
      "required": true
    },
    {
      "name": "effectiveTo",
      "type": "DateTime",
      "mode": "stored",
      "description": "The timestamp when this credential ceased to be valid, replaced by a new credential or explicitly revoked, marking the end of this credential's active lifecycle",
      "nullable": true
    },
    {
      "name": "changeReason",
      "type": "string",
      "mode": "enum",
      "description": "The categorized reason why this credential was replaced or revoked, providing context for security analysis and compliance reporting",
      "enum": [
        "routine_update",
        "expiration",
        "compromise_suspected",
        "compromise_confirmed",
        "administrative_reset",
        "policy_enforcement",
        "principal_request",
        "initial_assignment"
      ],
      "nullable": true
    },
    {
      "name": "changeInitiator",
      "type": "SecurityPrincipal",
      "mode": "stored",
      "description": "The security principal who initiated or authorized the credential change, which may be the credential owner themselves, an administrator, or an automated system process",
      "nullable": true
    },
    {
      "name": "strengthScore",
      "type": "integer",
      "mode": "computed",
      "description": "A normalized quality score (0-100) representing the cryptographic strength or complexity of this credential when it was active, calculated based on length, character diversity, entropy, and resistance to common attack patterns",
      "min": 0,
      "max": 100
    }
  ],
  "examples": [
    {
      "@type": "PasswordHistory",
      "principal": {
        "@type": "SecurityPrincipal",
        "principalType": "user",
        "displayName": "Emma Chen"
      },
      "hashingAlgorithm": "argon2id",
      "effectiveFrom": "2024-01-15T09:30:00Z",
      "effectiveTo": "2024-04-15T14:22:00Z",
      "changeReason": "expiration",
      "changeInitiator": {
        "@type": "SecurityPrincipal",
        "principalType": "user",
        "displayName": "Emma Chen"
      },
      "strengthScore": 82
    },
    {
      "@type": "PasswordHistory",
      "principal": {
        "@type": "SecurityPrincipal",
        "principalType": "user",
        "displayName": "Marcus Thompson"
      },
      "hashingAlgorithm": "bcrypt",
      "effectiveFrom": "2023-11-20T08:00:00Z",
      "effectiveTo": "2024-02-28T16:45:00Z",
      "changeReason": "compromise_suspected",
      "changeInitiator": {
        "@type": "SecurityPrincipal",
        "principalType": "administrator",
        "displayName": "Security Admin"
      },
      "strengthScore": 58
    },
    {
      "@type": "PasswordHistory",
      "principal": {
        "@type": "SecurityPrincipal",
        "principalType": "service_account",
        "displayName": "API Gateway Service"
      },
      "hashingAlgorithm": "argon2id",
      "effectiveFrom": "2024-03-01T00:00:00Z",
      "effectiveTo": null,
      "changeReason": "policy_enforcement",
      "changeInitiator": {
        "@type": "SecurityPrincipal",
        "principalType": "system",
        "displayName": "Automated Rotation Service"
      },
      "strengthScore": 95
    }
  ]
}
