{
  "@type": "Schema",
  "@context": "https://rocketschema.org/context",
  "name": "SecurityQuestion",
  "description": "Represents a knowledge-based authentication challenge used to verify identity during account recovery or sensitive operations. Security questions are personal inquiries that only the legitimate account holder should be able to answer correctly, such as 'What was the name of your first school?' or 'In what city were you born?' This entity captures the relationship between a specific question and a user who has chosen to use it as a verification method. The question itself may be selected from a predefined set of common questions or created as a custom challenge by the user. Security questions serve as a fallback authentication mechanism when primary methods are unavailable, providing identity verification without requiring external devices or services. They are particularly valuable in account recovery scenarios where users cannot access their email, phone, or other registered recovery methods. While simpler than modern multi-factor authentication, security questions remain widely used due to their accessibility and ease of setup. The system typically requires users to configure multiple questions and answer them correctly in combination to enhance security and prevent unauthorized access through guessing or social engineering attacks.",
  "properties": [
    {
      "name": "principal",
      "type": "SecurityPrincipal",
      "mode": "stored",
      "description": "The security principal (user, service account, etc.) who configured this challenge question for identity verification",
      "required": true
    },
    {
      "name": "questionTemplate",
      "type": "QuestionTemplate",
      "mode": "stored",
      "description": "Reference to the question template being used, whether from a predefined library or custom-created by the user",
      "required": false,
      "nullable": true
    },
    {
      "name": "customQuestion",
      "type": "string",
      "mode": "stored",
      "description": "The custom question text when the principal creates their own unique challenge instead of selecting from predefined templates",
      "required": false,
      "nullable": true,
      "example": "What was the model of your first vehicle?"
    },
    {
      "name": "responseDigest",
      "type": "string",
      "mode": "stored",
      "description": "Cryptographic representation of the correct answer, stored securely to enable verification without exposing the plaintext response",
      "required": true,
      "private": true
    },
    {
      "name": "hint",
      "type": "string",
      "mode": "stored",
      "description": "Optional memory aid provided by the principal to help recall the answer without revealing it completely",
      "required": false,
      "nullable": true,
      "example": "My childhood pet"
    },
    {
      "name": "sequence",
      "type": "integer",
      "mode": "stored",
      "description": "Display and evaluation order when multiple challenge questions are configured for a single principal",
      "required": false,
      "nullable": true,
      "default": 0,
      "example": 1
    },
    {
      "name": "status",
      "type": "string",
      "mode": "enum",
      "description": "Current state of this challenge question in its lifecycle from configuration to potential deactivation",
      "enum": [
        "active",
        "inactive",
        "suspended",
        "expired"
      ],
      "required": true,
      "default": "active",
      "example": "active"
    },
    {
      "name": "activatedAt",
      "type": "DateTime",
      "mode": "stored",
      "description": "Timestamp when this challenge question was first enabled and became available for verification purposes",
      "required": true,
      "example": "2024-01-15T08:30:00Z"
    },
    {
      "name": "expiresAt",
      "type": "DateTime",
      "mode": "stored",
      "description": "Optional expiration timestamp after which this challenge question must be reconfigured or updated for security purposes",
      "required": false,
      "nullable": true,
      "example": "2025-01-15T08:30:00Z"
    },
    {
      "name": "lastVerifiedAt",
      "type": "DateTime",
      "mode": "stored",
      "description": "Most recent timestamp when this challenge question was successfully answered during an authentication or verification flow",
      "required": false,
      "nullable": true,
      "example": "2024-11-10T14:22:00Z"
    }
  ],
  "examples": [
    {
      "@type": "SecurityQuestion",
      "principal": {
        "@type": "SecurityPrincipal",
        "identifier": "user_12345"
      },
      "questionTemplate": {
        "@type": "QuestionTemplate",
        "identifier": "qt_first_pet"
      },
      "customQuestion": null,
      "hint": "Golden retriever from childhood",
      "sequence": 1,
      "status": "active",
      "activatedAt": "2024-01-15T08:30:00Z",
      "expiresAt": "2025-01-15T08:30:00Z",
      "lastVerifiedAt": "2024-11-10T14:22:00Z"
    },
    {
      "@type": "SecurityQuestion",
      "principal": {
        "@type": "SecurityPrincipal",
        "identifier": "user_67890"
      },
      "questionTemplate": null,
      "customQuestion": "What was the name of my favorite childhood teacher?",
      "hint": "Taught mathematics in middle school",
      "sequence": 2,
      "status": "active",
      "activatedAt": "2024-03-20T10:00:00Z",
      "expiresAt": null,
      "lastVerifiedAt": "2024-10-05T16:45:00Z"
    }
  ]
}
