{
  "@type": "Schema",
  "@context": "https://rocketschema.org/context",
  "name": "TwoFactorBackupCode",
  "description": "Represents a single-use recovery code that provides emergency access when the primary authentication method is unavailable. These codes serve as a safety mechanism across various secure systems - from multi-factor authentication in enterprise applications to emergency access in medical records, financial systems, or secure communication platforms. Each code is cryptographically hashed and can only be used once to prevent replay attacks. Organizations typically generate sets of 8-20 codes simultaneously, allowing users to maintain secure access even when primary credentials are compromised, devices are lost, or authentication infrastructure fails. The sequential numbering helps users track which codes remain unused. Common applications include: employee access recovery in corporate systems, patient portal emergency access in healthcare, secure document retrieval in legal systems, emergency fund access in banking, and backup authentication for government services. The codes may have expiration dates to enforce periodic regeneration for security compliance. Upon usage, the code is permanently invalidated and the usage event is logged separately for audit purposes. This pattern ensures users are never locked out while maintaining strict security controls through one-time-use enforcement and cryptographic protection.",
  "properties": [
    {
      "name": "authenticationMethod",
      "type": "AuthenticationMethod",
      "mode": "stored",
      "description": "Reference to the authentication configuration this recovery code belongs to",
      "required": true
    },
    {
      "name": "codeHash",
      "type": "string",
      "mode": "stored",
      "description": "Cryptographic hash of the recovery code value for secure storage and verification",
      "required": true,
      "private": true
    },
    {
      "name": "sequenceNumber",
      "type": "integer",
      "mode": "stored",
      "description": "Sequential position of this code within the generated set for user reference and tracking",
      "required": true
    },
    {
      "name": "generatedAt",
      "type": "DateTime",
      "mode": "stored",
      "description": "Timestamp when this recovery code was created and added to the available set",
      "required": true
    },
    {
      "name": "expiresAt",
      "type": "DateTime",
      "mode": "stored",
      "description": "Optional expiration timestamp after which this code can no longer be used for access recovery",
      "nullable": true
    },
    {
      "name": "invalidatedAt",
      "type": "DateTime",
      "mode": "stored",
      "description": "Timestamp when this code was consumed or manually revoked, making it permanently unusable",
      "nullable": true
    },
    {
      "name": "isActive",
      "type": "boolean",
      "mode": "computed",
      "description": "Indicates whether this code is currently valid for use - computed from invalidatedAt and expiresAt values"
    }
  ],
  "examples": [
    {
      "@type": "TwoFactorBackupCode",
      "authenticationMethod": {
        "@type": "AuthenticationMethod",
        "name": "Enterprise SSO Backup"
      },
      "sequenceNumber": 1,
      "generatedAt": "2024-01-15T10:00:00Z",
      "expiresAt": "2025-01-15T10:00:00Z",
      "invalidatedAt": null
    },
    {
      "@type": "TwoFactorBackupCode",
      "authenticationMethod": {
        "@type": "AuthenticationMethod",
        "name": "Healthcare Portal Access"
      },
      "sequenceNumber": 5,
      "generatedAt": "2024-01-15T10:00:00Z",
      "expiresAt": "2025-01-15T10:00:00Z",
      "invalidatedAt": "2024-11-08T14:22:00Z"
    },
    {
      "@type": "TwoFactorBackupCode",
      "authenticationMethod": {
        "@type": "AuthenticationMethod",
        "name": "Financial Services Emergency Access"
      },
      "sequenceNumber": 3,
      "generatedAt": "2024-06-01T08:30:00Z",
      "expiresAt": null,
      "invalidatedAt": null
    }
  ]
}
