{
  "@type": "Schema",
  "@context": "https://rocketschema.org/context",
  "name": "UserEmail",
  "description": "Represents an email address associated with a user account in any system where users need contact information or electronic communication channels. This entity models the fundamental relationship between a person and their email addresses, which is universal across industries - from healthcare patient portals to financial services customer accounts, from educational institutions to government services. Users may associate multiple email addresses with their account for different purposes, and each email serves as both an identifier and a communication channel. The entity captures essential attributes like the email address itself, its purpose or category, and verification status (whether the user has proven ownership). In modern multi-channel systems, users often maintain several email addresses serving different roles: one might be designated for authentication and critical notifications, another for routine communications, and others for specific categories of correspondence. The verification status is crucial because unverified emails cannot be reliably used for authentication or sensitive communications - users must prove ownership before an email becomes fully functional. Email addresses must be unique across all users in most systems, preventing conflicts and ensuring reliable message delivery. This entity is deliberately focused on the core email-user relationship, with related concerns like verification workflows, notification preferences, and delivery tracking handled by separate specialized entities following proper normalization principles.",
  "properties": [
    {
      "name": "user",
      "type": "User",
      "mode": "stored",
      "description": "The user account to which this email address belongs",
      "required": true
    },
    {
      "name": "address",
      "type": "string",
      "mode": "stored",
      "description": "The email address in standard format",
      "required": true,
      "format": "email",
      "unique": true
    },
    {
      "name": "category",
      "type": "string",
      "mode": "enum",
      "description": "The functional category or purpose of this email address",
      "enum": [
        "primary",
        "alternate",
        "recovery"
      ],
      "required": true
    },
    {
      "name": "isVerified",
      "type": "boolean",
      "mode": "stored",
      "description": "Whether the user has proven ownership of this email address through a verification process",
      "required": true,
      "default": false
    },
    {
      "name": "isActive",
      "type": "boolean",
      "mode": "stored",
      "description": "Whether this email address is currently active and available for use",
      "required": true,
      "default": true
    },
    {
      "name": "canAuthenticate",
      "type": "boolean",
      "mode": "stored",
      "description": "Whether this email address can be used as an identifier for authentication purposes",
      "required": true,
      "default": false
    },
    {
      "name": "canRecover",
      "type": "boolean",
      "mode": "stored",
      "description": "Whether this email address can be used for account recovery operations",
      "required": true,
      "default": true
    }
  ],
  "examples": [
    {
      "@type": "UserEmail",
      "user": "user_a7f3c2b1",
      "address": "sarah.martinez@example.com",
      "category": "primary",
      "isVerified": true,
      "isActive": true,
      "canAuthenticate": true,
      "canRecover": true
    },
    {
      "@type": "UserEmail",
      "user": "user_a7f3c2b1",
      "address": "smartinez.backup@example.net",
      "category": "recovery",
      "isVerified": true,
      "isActive": true,
      "canAuthenticate": false,
      "canRecover": true
    },
    {
      "@type": "UserEmail",
      "user": "user_b8e4d3c2",
      "address": "james.chen@example.org",
      "category": "primary",
      "isVerified": false,
      "isActive": false,
      "canAuthenticate": false,
      "canRecover": false
    }
  ]
}
