{
  "@type": "Schema",
  "@context": "https://rocketschema.org/context",
  "name": "UserPreference",
  "description": "Stores the personalized configuration choices made by individual users for specific preference settings within a system. Each instance represents a single user's selected value for one preference, creating a customized experience tailored to their needs and working style. This entity forms the user-specific layer of a preference system, where PreferenceDefinition entities define what preferences exist and their characteristics, while UserPreference entities capture each user's actual selections. By separating user choices from preference metadata, the design achieves normalization and allows preference definitions to be managed centrally while user values remain independent. Users can override system defaults, adjust settings to match their preferences, and create personalized configurations across various domains such as interface appearance, notification delivery, accessibility features, regional formats, privacy controls, and feature toggles. The entity supports different value types (string, number, boolean, JSON, date) as defined by the referenced preference definition. This architecture enables systems to provide flexible customization without requiring schema changes when new preferences are introduced, scales efficiently across large user populations, and maintains clear separation between configuration templates and user-specific data. Applications range from simple on-off toggles to complex structured configurations like custom dashboard layouts or workflow preferences.",
  "properties": [
    {
      "name": "user",
      "type": "User",
      "mode": "stored",
      "description": "The user who has set this personalized preference value",
      "required": true
    },
    {
      "name": "preferenceDefinition",
      "type": "PreferenceDefinition",
      "mode": "stored",
      "description": "The preference definition that specifies the structure, validation rules, and metadata for this preference",
      "required": true
    },
    {
      "name": "value",
      "type": "string",
      "mode": "stored",
      "description": "The user's chosen value for this preference, stored as a string and parsed according to the preference definition's value type",
      "required": true,
      "example": "dark"
    },
    {
      "name": "effectiveValue",
      "type": "string",
      "mode": "computed",
      "description": "The actual value in effect for this user, which may be the user-set value or the default from the preference definition if no user value exists"
    },
    {
      "name": "isOverridden",
      "type": "boolean",
      "mode": "computed",
      "description": "Whether the user has explicitly set a value different from the system default"
    }
  ],
  "examples": [
    {
      "@type": "UserPreference",
      "value": "false"
    },
    {
      "@type": "UserPreference",
      "value": "{\"columns\":3,\"components\":[{\"id\":\"statistics\",\"position\":1},{\"id\":\"chart\",\"position\":2},{\"id\":\"list\",\"position\":3}]}"
    },
    {
      "@type": "UserPreference",
      "value": "Asia/Tokyo"
    }
  ]
}
