{
  "@type": "Schema",
  "@context": "https://rocketschema.org/context",
  "name": "UserMetadata",
  "description": "Represents extended attributes attached to users, providing a flexible mechanism for storing custom properties beyond the core user schema. This entity enables systems to associate arbitrary key-value pairs with user entities without requiring schema modifications. Extended attributes are fundamental in systems that need customization, personalization, or integration with external data sources. Each attribute has a defined data type to ensure proper interpretation and validation of stored values. The temporal validity pattern allows attributes to be time-bound, supporting use cases like temporary access grants, promotional periods, or experimental features with defined lifespans. This pattern is universal across domains: healthcare systems store patient preferences, educational platforms track learning styles, financial systems maintain risk parameters, retail systems record shopping preferences, and government systems capture citizen-specific data. The key-value model supports heterogeneous data requirements while maintaining a consistent storage and retrieval interface.",
  "properties": [
    {
      "name": "user",
      "type": "User",
      "mode": "stored",
      "description": "The user to whom this attribute is attached",
      "required": true
    },
    {
      "name": "key",
      "type": "string",
      "mode": "stored",
      "description": "Unique identifier for this attribute within the context of the user",
      "required": true,
      "example": "preferredLanguage"
    },
    {
      "name": "value",
      "type": "string",
      "mode": "stored",
      "description": "The stored value, serialized as a string and interpreted according to the valueType",
      "required": true,
      "example": "en-US"
    },
    {
      "name": "valueType",
      "type": "string",
      "mode": "enum",
      "description": "The data type of the value, determining how the string representation should be parsed and validated",
      "enum": [
        "string",
        "number",
        "boolean",
        "date",
        "json"
      ],
      "required": true,
      "default": "string"
    },
    {
      "name": "namespace",
      "type": "string",
      "mode": "stored",
      "description": "Logical grouping namespace to organize related attributes and prevent key collisions across different functional areas",
      "nullable": true,
      "example": "preferences"
    },
    {
      "name": "validFrom",
      "type": "DateTime",
      "mode": "stored",
      "description": "The date and time when this attribute becomes valid and should be considered active",
      "nullable": true
    },
    {
      "name": "validUntil",
      "type": "DateTime",
      "mode": "stored",
      "description": "The date and time when this attribute expires and should no longer be considered active",
      "nullable": true
    }
  ],
  "examples": [
    {
      "@type": "UserMetadata",
      "user": "user_alice_001",
      "key": "communicationPreference",
      "value": "email",
      "valueType": "string",
      "namespace": "preferences",
      "validFrom": "2024-01-15T00:00:00Z",
      "validUntil": null
    },
    {
      "@type": "UserMetadata",
      "user": "user_bob_002",
      "key": "riskScore",
      "value": "7.5",
      "valueType": "number",
      "namespace": "assessment",
      "validFrom": "2024-03-01T00:00:00Z",
      "validUntil": "2024-09-01T00:00:00Z"
    },
    {
      "@type": "UserMetadata",
      "user": "user_carol_003",
      "key": "betaAccess",
      "value": "true",
      "valueType": "boolean",
      "namespace": "features",
      "validFrom": "2024-02-01T00:00:00Z",
      "validUntil": "2024-08-01T00:00:00Z"
    }
  ]
}
